#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.network.google_compute_network.vpc: Refreshing state... [id=projects/portfogram-gke/global/networks/dev-portfogram-vpc]
module.network.google_compute_subnetwork.public_subnet: Refreshing state... [id=projects/portfogram-gke/regions/asia-northeast3/subnetworks/dev-portfogram-public-subnet]
module.network.google_compute_router.nat_router: Refreshing state... [id=projects/portfogram-gke/regions/asia-northeast3/routers/dev-portfogram-nat-router]
module.network.google_compute_firewall.allow_external: Refreshing state... [id=projects/portfogram-gke/global/firewalls/dev-portfogram-allow-external]
module.network.google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/portfogram-gke/regions/asia-northeast3/subnetworks/dev-portfogram-private-subnet]
module.network.google_compute_firewall.allow_internal: Refreshing state... [id=projects/portfogram-gke/global/firewalls/dev-portfogram-allow-internal]
module.network.google_compute_router_nat.nat_gw: Refreshing state... [id=portfogram-gke/asia-northeast3/dev-portfogram-nat-router/dev-portfogram-nat-gw]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/portfogram-gke/locations/asia-northeast3/clusters/dev-cluster]
module.gke.google_container_node_pool.public_node_pool: Refreshing state... [id=projects/portfogram-gke/locations/asia-northeast3/clusters/dev-cluster/nodePools/public-node-pool]
module.gke.google_container_node_pool.private_node_pool_1: Refreshing state... [id=projects/portfogram-gke/locations/asia-northeast3/clusters/dev-cluster/nodePools/private-node-pool-1]
module.gke.google_container_node_pool.private_node_pool_2: Refreshing state... [id=projects/portfogram-gke/locations/asia-northeast3/clusters/dev-cluster/nodePools/private-node-pool-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
      - datapath_provider                        = "" -> null
      - description                              = "" -> null
        id                                       = "projects/portfogram-gke/locations/asia-northeast3/clusters/dev-cluster"
        name                                     = "dev-cluster"
      - private_ipv6_google_access               = "" -> null
      - tpu_ipv4_cidr_block                      = "" -> null
        # (28 unchanged attributes hidden)








      ~ master_auth {
          - client_certificate     = "" -> null
          - client_key             = (sensitive value)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }












        # (21 unchanged blocks hidden)
    }

  # module.iam.google_project_iam_member.gke_service_account_iam will be created
  + resource "google_project_iam_member" "gke_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "portfogram-gke"
      + role    = "roles/container.admin"
    }

  # module.iam.google_project_iam_member.gke_service_account_iam_roles["roles/container.admin"] will be created
  + resource "google_project_iam_member" "gke_service_account_iam_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "portfogram-gke"
      + role    = "roles/container.admin"
    }

  # module.iam.google_project_iam_member.gke_service_account_iam_roles["roles/viewer"] will be created
  + resource "google_project_iam_member" "gke_service_account_iam_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "portfogram-gke"
      + role    = "roles/viewer"
    }

  # module.iam.google_service_account.gke_service_account will be created
  + resource "google_service_account" "gke_service_account" {
      + account_id   = "dev-portfogram-gke-sa"
      + disabled     = false
      + display_name = "GKE Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "portfogram-gke"
      + unique_id    = (known after apply)
    }

  # module.storage.google_storage_bucket.portfogram_tfstate_dev will be created
  + resource "google_storage_bucket" "portfogram_tfstate_dev" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST3"
      + name                        = "portfogram_tfstate_dev"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = true
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

*Pusher: @minina0407, Action: `pull_request`, Workflow: `Terraform CI/CD`*